/* --------------------------------------------------------------------------------------------- */
/* 여기까지 배포 완료 ( 배포일 : 2016. 11. 22. ) - 김상겸 */
/* --------------------------------------------------------------------------------------------- */

/* 2016. 12. 26. */
/* 2016. 12. 26. - 김상겸 */
/* 2016. 12. 26. - 김상겸 - 스마트 자금관리 쿼리 추가 */

/* 시퀀스 */
DELETE FROM `t_seq` WHERE `name` = 'accMoneyAuthSeq';

INSERT INTO t_seq ( `name`, `currval`, `description` )
VALUES ( 'accMoneyAuthSeq', '0', '자금관리 권한 시퀀스' );

UPDATE  `t_seq`
SET     `currval` = (
                SELECT  IFNULL(MAX(REPLACE(auth_code, 'A', '')), '0') AS auth_code
                FROM    t_smart_authcode
                WHERE   auth_code LIKE 'A%'
        )
WHERE   `name` = 'accMoneyAuthSeq';

/* 기본권한 */
DELETE FROM `t_smart_authcode` WHERE auth_code = 'USERREG';

INSERT IGNORE INTO `t_smart_authcode` ( `auth_code`, `comp_seq`, `use_yn`, `order_num`, `etc`, `create_seq`, `create_date`, `modify_seq`, `modify_date` )
VALUES ( 'USERREG', '1000', 'Y', '1', NULL, 'SYSTEM', NOW(), 'SYSTEM', NOW() );

INSERT IGNORE INTO `t_smart_authcode_multi` ( `auth_code`, `auth_code_nm`, `lang_code`, `create_seq`, `create_date`, `modify_seq`, `modify_date` )
VALUES ( 'USEREG', '사용자 지정권한', 'kr', 'SYSTEM', NOW(), 'SYSTEM', NOW() );

/* --------------------------------------------------------------------------------------------- */
/* 여기까지 배포 완료 ( 배포일 : 2016. 12. 26. ) - 김상겸 */
/* --------------------------------------------------------------------------------------------- */
/* --------------------------------------------------------------------------------------------- */
/* 여기까지 배포 완료 ( 배포일 : 2017. 02. 24. ) - 김상겸 */
/* --------------------------------------------------------------------------------------------- */
/* --------------------------------------------------------------------------------------------- */
/* 여기까지 배포 완료 ( 배포일 : 2017. 07. 18. ) - 김상겸 */
/* --------------------------------------------------------------------------------------------- */
/* --------------------------------------------------------------------------------------------- */
/* 여기까지 배포 완료 ( 배포일 : 2017. 08. 10. ) - 신재호 */
/* --------------------------------------------------------------------------------------------- */